In [401]:
import pandas as pd
import numpy as np

from datetime import date

### Importando dataset e-commerce

Para mas informacion del dataset, consulte en el siguiente [link](https://www.kaggle.com/datasets/carrie1/ecommerce-data)

In [402]:
ecommerce = pd.read_csv("ds_e_commerce.csv", delimiter=",")

In [403]:
ecommerce.head(5)

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,12/1/2010 8:26,2.55,17850.0,United Kingdom
1,536365,71053,WHITE METAL LANTERN,6,12/1/2010 8:26,3.39,17850.0,United Kingdom
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,12/1/2010 8:26,2.75,17850.0,United Kingdom
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,12/1/2010 8:26,3.39,17850.0,United Kingdom
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,12/1/2010 8:26,3.39,17850.0,United Kingdom

In [404]:
ecommerce.shape

(541909, 8)

### cast de fechas y tratamiento de columnas Dias, mes, año

In [405]:
ecommerce.dtypes

InvoiceNo       object
StockCode       object
Description     object
Quantity         int64
InvoiceDate     object
UnitPrice      float64
CustomerID     float64
Country         object
dtype: object

In [406]:
ecommerce["InvoiceDate"] = pd.to_datetime(ecommerce["InvoiceDate"])

In [407]:
ecommerce.dtypes

InvoiceNo              object
StockCode              object
Description            object
Quantity                int64
InvoiceDate    datetime64[ns]
UnitPrice             float64
CustomerID            float64
Country                object
dtype: object

In [408]:
ecommerce.head(1)

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,2010-12-01 08:26:00,2.55,17850.0,United Kingdom

In [409]:
ecommerce["year"] = ecommerce["InvoiceDate"].dt.year
ecommerce["month"] = ecommerce["InvoiceDate"].dt.month
ecommerce["day"] = ecommerce["InvoiceDate"].dt.day

In [410]:
ecommerce.head(1)

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,year,month,day
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,2010-12-01 08:26:00,2.55,17850.0,United Kingdom,2010,12,1

#### Exploracion de paises

In [317]:
ecommerce["Country"].drop_duplicates()

0               United Kingdom
26                      France
197                  Australia
385                Netherlands
1109                   Germany
1236                    Norway
1404                      EIRE
5320               Switzerland
6421                     Spain
6608                    Poland
7134                  Portugal
7214                     Italy
7279                   Belgium
7986                 Lithuania
9783                     Japan
14938                  Iceland
20000          Channel Islands
20017                  Denmark
29732                   Cyprus
30078                   Sweden
31464                  Austria
31982                   Israel
34083                  Finland
38313                  Bahrain
69007                   Greece
69623                Hong Kong
70758                Singapore
72985                  Lebanon
89570     United Arab Emirates
100810            Saudi Arabia
103598          Czech Republic
119191                  Canada
152712             Unspecified
157299                  Brazil
164464                     USA
168149      European Community
217684                   Malta
395472                     RSA
Name: Country, dtype: object

### Ejercicios

**Ejercicio 1:** Por país muestre cual fue el año en el que mejor ingreso se registro y su valor, adicional muestre cual fue el año con más Invoices (Frecuencia) y otra columna con el total.

Nota: Note que el año con mejor ingreso no es lo mismo con el año con mas invoices, por ejemplo en 2019 Honduras en dos invoices se facturo 10,000. sin embargo, en 2020 se realizaron 20 invoices (pueda que en este año el ingreso de esas invoices hayan sumado 7,000 inferior al 2020) 

*recuerde que el ejemplo es inventado*

Ejemplo de como se deberia de ver el dataframe resultante:

In [318]:
pd.DataFrame({
    "country" : ["Honduras"]
    , "YearMejorIngreso" : [2019]
    , "ValorYearMejorIngreso" : [20000]
    , "YearMejorFrecuenciaInvoices": [2020]
    , "CantidadYearMejorFrecuenciaInvoices": [20]
})

,country,YearMejorIngreso,ValorYearMejorIngreso,YearMejorFrecuenciaInvoices,CantidadYearMejorFrecuenciaInvoices
0,Honduras,2019,20000,2020,20

*Answer:*

In [411]:
e1_ecommerce = ecommerce[["Country","InvoiceNo"]]

In [412]:
e1_ecommerce

               Country InvoiceNo
0       United Kingdom    536365
1       United Kingdom    536365
2       United Kingdom    536365
3       United Kingdom    536365
4       United Kingdom    536365
...                ...       ...
541904          France    581587
541905          France    581587
541906          France    581587
541907          France    581587
541908          France    581587

[541909 rows x 2 columns]

In [ ]:
e2_ecommerce = ecommerce[["Quantity","UnitPrice","InvoiceDate"]]

In [383]:
e2_ecommerce

        Quantity  UnitPrice         InvoiceDate
0              6       2.55 2010-12-01 08:26:00
1              6       3.39 2010-12-01 08:26:00
2              8       2.75 2010-12-01 08:26:00
3              6       3.39 2010-12-01 08:26:00
4              6       3.39 2010-12-01 08:26:00
...          ...        ...                 ...
541904        12       0.85 2011-12-09 12:50:00
541905         6       2.10 2011-12-09 12:50:00
541906         4       4.15 2011-12-09 12:50:00
541907         4       4.15 2011-12-09 12:50:00
541908         3       4.95 2011-12-09 12:50:00

[541909 rows x 3 columns]

In [418]:
ecommerce_sum = ecommerce.loc[: , ["Quantity","UnitPrice"]].sum()

In [417]:
e1_ecommerce

Quantity     5176450.000
UnitPrice    2498803.974
dtype: float64

In [422]:
e1_ecommerce

Quantity     5176450.000
UnitPrice    2498803.974
dtype: float64

In [426]:
e2_ecommerce_sum = e2_ecommerce.groupby(["Quantity"]).sum()

In [428]:
e2_ecommerce_sum

          UnitPrice
Quantity
-80995         2.08
-74215         1.04
-9600          0.00
-9360          0.03
-9058          0.00
...             ...
 4800          0.21
 5568          0.00
 12540         0.00
 74215         1.04
 80995         2.08

[722 rows x 1 columns]

**Ejercicio 2:** Cual es el Top tres por año de los Invoices de lo mas facturado

Ejemplo de como se deberia de ver el dataframe resultante (Recuerde que este es un ejemplo inventado):

In [356]:
pd.DataFrame({
    "Year" : [2019,2019,2019,2020,2020,2020]
    , "Top" : [1,2,3,1,2,3]
    , "InvoiceNo" : [536365, 536999, 693365, 24987, 56832, 254232]    
    , "TotalInvoice": [30000,28000,27900,29000,25000,24600]
})

   Year  Top  InvoiceNo  TotalInvoice
0  2019    1     536365         30000
1  2019    2     536999         28000
2  2019    3     693365         27900
3  2020    1      24987         29000
4  2020    2      56832         25000
5  2020    3     254232         24600

*Answer:*

**Ejercicio 3:** Genere el siguiente Dataset para cada uno de los clientes:

In [ ]:
pd.DataFrame({
    "CustomerID" : [111,111,111]
    , "YearMonth" : ["2019-1","2019-2","2019-3"]
    , "TotalValorInvoices" : [20000,22000,0]    
    , "TotalCantidadInvoices" : [3,2,0]    
    , "FacturaSiguienteMes": [1,0,1]
})

*Ten en cuenta lo siguiente:*

Mediante el cross join puedo emular el producto cartesiano de dos vectores para obtener las combinaciones unicas de los valores de cada uno de ellos

In [ ]:
df1 = pd.DataFrame( {"year": [2019,2020]} )
df2 = pd.DataFrame( {"Cliente": [111,112,113]} )

df2.merge(df1, how='cross')

*Observaciones:*

* TotalValorInvoices: La suma del total facturado por todas sus facturas
* TotalCantidadInvoices: La cantidad de facturas unicas realizadas en ese mes
* FacturaSiguienteMes: Una variable de respuesta que nos dice si al siguiente mes por ese cliente se encontro por lo menos una factura.

Note que por la logica de este dataset el ultimo año-mes encontrado en todo el dataset se va a descartar del resultado final por que no se sabe el valor del siguiente mes. 1: si se encuentra una factura al siguiente mes, 0: no se encuentra nada.

*Answer:*

**Ejercicio cuatro:** Cual es el top 3 de los productos que menos ingresos generan por Pais del ultimo año encontrado del dataset.

Ejemplo de como se deberia de ver el dataframe resultante (Recuerde que este es un ejemplo inventado):

In [ ]:
pd.DataFrame({
    "Country" : ["Canada","Canada","Canada","Spain","Spain","Spain"]
    , "Top" : [1,2,3,1,2,3]    
    , "StockCode": [546,6886,665,656,888,668]
    , "Description": ["Product X","Product K","Product J","Product C","Product D","Product U"]
    , "TotalOnInvoices": [2000,2100,4000,3000,3800,3900]
})

*Answer:*

In [445]:
top_bajo_ecommerce = ecommerce.sort_values(["UnitPrice"],ascending=True)

In [446]:
resultado_top = top_bajo_ecommerce.groupby(["Quantity"]).agg({"UnitPrice":["count"]})

In [447]:
resultado_top

         UnitPrice
             count
Quantity
-80995           1
-74215           1
-9600            2
-9360            1
-9058            1
...            ...
 4800            1
 5568            1
 12540           1
 74215           1
 80995           1

[722 rows x 1 columns]

In [449]:
top_bajo_ecommerce.loc[:,["Quantity","UnitPrice"]].groupby(["Quantity"]).count()

          UnitPrice
Quantity
-80995            1
-74215            1
-9600             2
-9360             1
-9058             1
...             ...
 4800             1
 5568             1
 12540            1
 74215            1
 80995            1

[722 rows x 1 columns]